
-- 第1个值是固定值经验
-- 第2个值会和当前游戏波数相乘
-- 第3个值代表等级,经验为该等级的经验总和,改平衡常数时请同时改该文件(不过等级的[上一个值因素]太难算了,摸)
local data = {
    ['锻造石boss-1'] = {1000, 0, 0},
    ['锻造石boss-2'] = {2000, 0, 0},
    ['锻造石boss-3'] = {3000, 0, 0},
    ['锻造石boss-4'] = {4000, 0, 0},
    ['锻造石boss-5'] = {5000, 0, 0},
    ['锻造石boss-6'] = {6000, 0, 0},
    ['锻造石boss-7'] = {7000, 0, 0},
    ['锻造石boss-8'] = {8000, 0, 0},
    ['锻造石boss-9'] = {9000, 0, 0},
    ['锻造石boss-10'] = {10000, 0, 0},
    ['锻造石boss-11'] = {20000, 0, 0},
    ['觉醒boss-1'] = {2000, 0, 0},
    ['觉醒boss-2'] = {4000, 0, 0},
    ['觉醒boss-3'] = {6000, 0, 0},
    ['觉醒boss-4'] = {8000, 0, 0},
    ['觉醒boss-5'] = {10000, 0, 0},
    ['觉醒boss-6'] = {12000, 0, 0},
    ['觉醒boss-7'] = {14000, 0, 0},
    ['觉醒boss-8'] = {16000, 0, 0},
    ['觉醒boss-9'] = {18000, 0, 0},
    ['觉醒boss-10'] = {20000, 0, 0},
    ['金币怪1'] = {0, 30, 0},
    ['金币怪2'] = {0, 30, 0},
    ['木材怪1'] = {0, 30, 0},
    ['木材怪2'] = {0, 30, 0},
    ['木材怪3'] = {0, 30, 0},
    ['经验宝宝1'] = {500, 30, 0},
    ['波数1'] = {0, 20, 0},
    ['波数2'] = {0, 20, 0},
    ['波数3'] = {0, 20, 0},
    ['波数4'] = {0, 20, 0},
    ['波数5'] = {0, 20, 0},
    ['波数6'] = {0, 20, 0},
    ['波数7'] = {0, 20, 0},
    ['波数8'] = {0, 20, 0},
    ['波数9'] = {0, 20, 0},
    ['波数10'] = {0, 20, 0},
    ['波数11'] = {0, 20, 0},
    ['波数12'] = {0, 20, 0},
    ['波数13'] = {0, 20, 0},
    ['波数14'] = {0, 20, 0},
    ['波数15'] = {0, 20, 0},
    ['波数16'] = {0, 20, 0},
    ['波数17'] = {0, 20, 0},
    ['波数18'] = {0, 20, 0},
    ['波数19'] = {0, 20, 0},
    ['波数20'] = {0, 20, 0},
    ['波数21'] = {0, 20, 0},
    ['波数22'] = {0, 20, 0},
    ['波数23'] = {0, 20, 0},
    ['波数24'] = {0, 20, 0},
    ['波数25'] = {0, 20, 0},
    ['波数26'] = {0, 20, 0},
    ['波数27'] = {0, 20, 0},
    ['波数28'] = {0, 20, 0},
    ['波数29'] = {0, 20, 0},
    ['波数30'] = {0, 20, 0},
    ['波数31'] = {0, 20, 0},
    ['波数32'] = {0, 20, 0},
    ['波数33'] = {0, 20, 0},
    ['波数34'] = {0, 20, 0},
    ['波数35'] = {0, 20, 0},
    ['波数36'] = {0, 20, 0},
    ['波数37'] = {0, 20, 0},
    ['波数38'] = {0, 20, 0},
    ['波数39'] = {0, 20, 0},
    ['波数40'] = {0, 20, 0},
}

ac.game:event('单位-创建', function (_, unit)
    local name = unit:getName()
    if data[name] then
        local exp = 0
        if data[name][1] > 0 then
            exp = exp + data[name][1]
        end
        if data[name][2] > 0 then
            local wave = math.max(1,sg.get_wave())
            exp = exp + data[name][2] * wave
        end
        if data[name][3] > 0 then
            exp = exp + (200 + (data[name][3] - 1) * 15) * data[name][3] / 2
        end
        unit:add('死亡经验', exp)
    end
end)